# Create some Sample Data üìå

In [1]:
%load_ext sql

In [2]:
%%sql sqlite://
CREATE TABLE Person (first_name, last_name, city);
INSERT INTO Person VALUES ('Sergio', 'Diego', 'New-York');
INSERT INTO Person VALUES ('Steffan', 'Ramos', 'SF');

Done.
1 rows affected.
1 rows affected.

[]

# 1. Query the Data and Convert to Pandas Dataframe üêº

In [3]:
result = %sql SELECT * FROM Person WHERE city == 'New-York'

df = result.DataFrame()
df

*  sqlite://
Done.

  first_name last_name      city
0     Sergio     Diego  New-York

# 2. Convert Automatically by setting 'autopandas =True'

In [4]:
%config SqlMagic.autopandas = True

df = %sql SELECT * FROM Person

df

*  sqlite://
Done.

  first_name last_name      city
0     Sergio     Diego  New-York
1    Steffan     Ramos        SF

In [6]:
import os

In [7]:
os.getcwd()

'/Users/sumanthpapareddy'